import { Box, Typography } from "@mui/material";

export const ZakatAssets = () => {
  return (
    <Box>
      <Typography mb={1}>
        ১. সব ধরনের সম্পদ ও সামগ্রীর ওপর যাকাত ফরয হয় না। শুধু সোনা-রুপা, টাকা-পয়সা, পালিত পশু (নির্ধারিত নিয়ম
        অনুযায়ী) এবং ব্যবসার পণ্যে যাকাত ফরয হয়।
      </Typography>

      <Typography mb={1}>
        ২. সোনা-রুপার অলংকার সর্বদা বা কালেভদ্রে ব্যবহৃত হোক কিংবা একেবারেই ব্যবহার না করা হোক সর্বাবস্থাতেই তার যাকাত
        দিতে হবে।
      </Typography>

      <Typography>
        ৩. অলংকার ছাড়া সোনা-রুপার অন্যান্য সামগ্রীর ওপরও যাকাত ফরয হয়। জামা-কাপড় কিংবা অন্য কোনো সামগ্রীতে সোনা-রুপার
        কারুকাজ করা থাকলে তাও যাকাতের হিসাবের অন্তর্ভুক্ত হবে এবং যে পরিমাণ সোনা-রুপা কারুকাজে লেগেছে অন্যান্য
        যাকাতযোগ্য সম্পদের সঙ্গে তারও যাকাত দিতে হবে।
      </Typography>

      <Typography mb={1}>
        সোনা-রুপা ছাড়া অন্য কোনো ধাতুর অলংকার ইত্যাদির উপর যাকাত ফরয নয়। তদ্রূপ হিরা, মণি-মুক্তা ইত্যাদি মূল্যবান পাথর
        ব্যবসা পণ্য না হলে সেগুলোতেও যাকাত ফরয নয়।
      </Typography>

      <Typography mb={1}>
        ৪. মৌলিক প্রয়োজন থেকে উদ্ধৃত্ত টাকা-পয়সা নিসাব পরিমাণ হলে এবং এক বছর স্থায়ী হলে বছর শেষে তার যাকাত আদায় করা
        ফরয হয়।
      </Typography>

      <Typography mb={1}>
        ৫. টাকা-পয়সা ব্যবসায় না খাটিয়ে এমনি রেখে দিলে ও তাতে যাকাত ফরয হয়। হজ্বের উদ্দেশ্যে কিংবা ঘর-বাড়ি নির্মাণ,
        ছেলে-মেয়ের বিয়ে-শাদি ইত্যাদি প্রয়োজনের জন্য যে অর্থ সঞ্চয় করা হচ্ছে তাও এর ব্যতিক্রম নয়। সঞ্চিত অর্থ
        পৃথকভাবে কিংবা অন্যান্য যাকাতযোগ্য সম্পদের সাথে যুক্ত হয়ে নিসাব পরিমাণ হলে এবং নিসাবের ওপর এক বছর অতিবাহিত হলে
        যাকাত ফরয হবে। বছর পূর্ণ হওয়ার আগেই তা যদি খরচ হয়ে যায় তাহলে যাকাত ফরয হবে না।
      </Typography>

      <Typography mb={1}>
        ৬. দোকান-পাটে যা কিছু বিক্রয়ের উদ্দেশ্যে রাখা থাকে তা বাণিজ্য-দ্রব্য। এর মূল্য নিসাব পরিমাণ হলে যাকাত আদায় করা
        ফরয।
      </Typography>

      <Typography mb={1}>
        ৭. ব্যবসার নিয়তে কোনো কিছু ক্রয় করলে তা স্থাবর সম্পত্তি হোক যেমন জমি-জমা, ফ্ল্যাট কিংবা অস্থাবর যেমন মুদী
        সামগ্রী, কাপড়-চোপড়, অলংকার, নির্মাণ সামগ্রী, গাড়ি, ফার্নিচার, ইলেক্ট্রনিক সামগ্রী, হার্ডওয়ার সামগ্রী,
        বইপুস্তক ইত্যাদি, তা বাণিজ্য-দ্রব্য বলে গণ্য হবে এবং মূল্য নিসাব পরিমাণ হলে যাকাত দেওয়া ফরয হবে।
      </Typography>
    </Box>
  );
};
