import { Box, Typography } from "@mui/material";
import styles from "../Masala/masala.module.css";

export const WhatIsZakat = () => {
  return (
    <Box>
      <Typography mb={1}>
        যাকাত আরবী শব্দ যার অর্থ পবিত্রতা, প্রবৃদ্ধি, বরকত, প্রশংসা, স্তুতি। ইসলামী শরীয়তের পরিভাষায়,
      </Typography>

      <Typography mb={3} className={styles.quote}>
        আল্লাহ তায়ালার হুকুম পালনার্থে যাকাতযোগ্য অর্থ-সম্পদের শরীয়ত নির্ধারিত পরিমাণ অংশ নিজের সব ধরণের হস্তক্ষেপ ও
        সুযোগ-সুবিধা মুক্ত করে যাকাত গ্রহণের যোগ্য গরিব-মিসকীনদেরকে পূর্ণ মালিকানা দান করাই হল 'যাকাত'।
      </Typography>

      <Typography mb={1}>
        যাকাত ইসলামের অত্যন্ত গুরুত্বপূর্ণ রোকন। ঈমানের পর সর্বাধিক গুরুত্বপূর্ণ ও অপরিহার্য ইবাদত হল সালাত ও যাকাত।
        নামায যেভাবে শারিরিক ইবাদতের মধ্যে প্রথম সারির ইবাদত সেভাবে আর্থিক ইবাদতের মধ্যে যাকাত প্রথম সারির ইবাদত। কুরআন
        মাজীদে বহু স্থানে সালাত-যাকাতের আদেশ করা হয়েছে এবং আল্লাহর অনুগত বান্দাদের জন্য অশেষ ছওয়াব, রহমত ও মাগফিরাতের
        পাশাপাশি আত্মশুদ্ধির ও প্রতিশ্রুতি দেওয়া হয়েছে। এক আয়াতে ইরশাদ হয়েছে -
      </Typography>

      <Typography mb={3} className={styles.quote}>
        তোমরা সালাত আদায় কর এবং যাকাত প্রদান কর। তোমরা যে উত্তম কাজ নিজেদের জন্য অগ্রে প্রেরণ করবে তা আল্লাহর নিকটে
        পাবে। নিশ্চয়ই তোমরা যা কর আল্লাহ তা দেখছেন। - সূরা বাকারাঃ ১১০
      </Typography>

      <Typography mb={1}>অন্য আয়াতে ইরশাদ হয়েছে -</Typography>

      <Typography mb={3} className={styles.quote}>
        তোমরা সালাত আদায় কর, যাকাত দাও এবং রাসূলের আনুগত্য কর যাতে তোমরা অনুগ্রহভাজন হতে পার। - সূরা নূরঃ ৫৬
      </Typography>

      <Typography mb={1}>
        সূরা নিসার ১৬২ নং আয়াতে আল্লাহ তাআলা তার বান্দাদের জন্য ‘আজরুন আযীম’-এর প্রতিশ্রুতি দিয়েছেন। ইরশাদ হয়েছে -
      </Typography>

      <Typography mb={3} className={styles.quote}>
        এবং যারা সালাত আদায় করে, যাকাত দেয় এবং আল্লাহ ও পরকালে ঈমান রাখে আমি তাদেরকে মহা পুরস্কার দিব।
      </Typography>

      <Typography mb={1}>অন্য আয়াতে যাকাতের গুরুত্বপূর্ণ সুফল বর্ণনা করে আল্লাহ তাআলা বলেন-</Typography>

      <Typography mb={3} className={styles.quote}>
        তাদের সম্পদ থেকে সদকা গ্রহণ করুন, যার দ্বারা আপনি তাদেরকে পবিত্র করবেন এবং পরিশোধিত করবেন এবং আপনি তাদের জন্য
        দুআ করবেন। আপনার দুআ তো তাদের জন্য চিত্ত স্বস্তিকর। আল্লাহ সর্বশ্রোতা, সর্বজ্ঞ। - সূরা তাওবাঃ ১০৩
      </Typography>

      <Typography mb={1}>
        এছাড়া কুরআন মাজীদের বিভিন্ন আয়াত থেকে পরিষ্কার জানা যায় যে, সালাত ও যাকাতের পাবন্দী ছাড়া আল্লাহর নৈকট্য
        অর্জনের প্রশ্নই অবান্তর। কুরআন ্মাজীদের বিভিন্ন আয়াতে, যেখানে খাঁটি মু’মিনের গুণ ও বৈশিষ্ট্য উল্লেখিত হয়েছে
        সেখানে সালাত-যাকাতের কথা এসেছে অপরিহার্যভাবে।
      </Typography>

      <Typography mb={1} className={styles.quote}>
        ভালো কাজ এটা নয় যে, তোমরা তোমাদের চেহারা পূর্ব ও পশ্চিম দিকে ফিরাবে; বরং ভালো কাজ হল যে ঈমান আনে আল্লাহ, শেষ
        দিবস, ফেরেশতাগণ, কিতাব ও নবীগণের প্রতি এবং যে সম্পদ প্রদান করে তার প্রতি আসক্তি সত্ত্বেও নিকটাত্মীয়গণকে, ইয়াতীম,
        অসহায়, মুসাফির ও প্রার্থনাকারীকে এবং বন্দিমুক্তিতে এবং যে সালাত কায়েম করে, যাকাত দেয় এবং যারা অঙ্গীকার করে তা
        পূর্ণ করে, যারা ধৈর্যধারণ করে কষ্ট ও দুর্দশায় ও যুদ্ধের সময়ে। তারাই সত্যবাদী এবং তারাই মুত্তাকী। - সূরা বাকারাঃ
        ১৭৭
      </Typography>

      <Typography mb={1} className={styles.quote}>
        তোমাদের বন্ধু কেবল আল্লাহ, তাঁর রাসূল ও মুমিনগণ, যারা সালাত কায়েম করে এবং যাকাত প্রদান করে বিনীত হয়ে। - সূরা
        মায়েদাঃ ৫৫
      </Typography>

      <Typography mb={1} className={styles.quote}>
        একমাত্র তারাই আল্লাহর মসজিদসমূহ আবাদ করবে, যারা আল্লাহ ও শেষ দিনের প্রতি ঈমান রাখে, সালাত কায়েম করে, যাকাত
        প্রদান করে এবং আল্লাহ ছাড়া কাউকে ভয় করে না। আশা করা যায়, ওরা হিদায়াতপ্রাপ্তদের অন্তর্ভুক্ত হবে। - সূরা তাওবাঃ ১৮
      </Typography>

      <Typography mb={1} className={styles.quote}>
        তারা এমন যাদেরকে আমি যমীনে ক্ষমতা দান করলে তারা সালাত কায়েম করবে, যাকাত দেবে এবং সৎকাজের আদেশ দেবে ও অসৎকাজ থেকে
        নিষেধ করবে; আর সব কাজের পরিণাম আল্লাহরই অধিকারে। - সূরা হজ্জ্বঃ ৪১
      </Typography>

      <Typography mb={3} className={styles.quote}>
        আর তাদেরকে কেবল এই নির্দেশ দেয়া হয়েছিল যে, তারা যেন আল্লাহর ‘ইবাদাত করে তাঁরই জন্য দীনকে একনিষ্ঠ করে, সালাত
        কায়েম করে এবং যাকাত দেয়; আর এটিই হল সঠিক দীন। - সূরা বাইয়েনাঃ ৫
      </Typography>

      <Typography mb={1}>
        মোটকথা, এত অধিক গুরুত্বের সঙ্গে সালাত-যাকাত প্রসঙ্গে কুরআন মাজীদে এসেছে যে, এটা ছাড়া দ্বীন ও ঈমানের অস্তিত্বই
        কল্পনা করা যায় না। মুমিনের অন্তরের ঈমান সালাত-যাকাতের বিশ্বাসের ওপর এবং তার কর্মের ঈমান সালাত-যাকাতের কর্মগত
        বাস্তবায়নের ওপর নির্ভরশীল। এখান থেকে এ বিষয়টাও অনুমান করা যায় যে, ফরয হওয়া সত্ত্বেও যারা যাকাত আদায় করে না
        তারা কত বড় ক্ষতিগ্রস্ততার শিকার! যাকাতের সকল সুফল থেকে বঞ্চিত হওয়ার পাশাপাশি আল্লাহর আদেশ অমান্য করার কারণে
        তাদেরকে যে মর্মন্তুদ শাস্তির মুখোমুখি হতে হবে তা ও কুরআন মাজীদে বলে দেওয়া হয়েছে। ইরশাদ হয়েছে -
      </Typography>

      <Typography mb={3} className={styles.quote}>
        আর আল্লাহ নিজ অনুগ্রহে যা তোমাদেরকে দিয়েছেন তাতে যারা কৃপণতা করে তারা যেন কিছুতেই মনে না করে যে, এটা তাদের জন্য
        মঙ্গল। না, এটা তাদের জন্য অমঙ্গল। যে সম্পদে তারা কৃপণতা করেছে কিয়ামতের দিন তা-ই তাদের গলায় বেড়ি হবে। আসমান ও
        যমীনের স্বত্ত্বাধিকার একমাত্র আল্লাহরই। তোমরা যা কর আল্লাহ তা বিশেষভাবে অবগত। - সূরা আল-ইমরানঃ ১৮০
      </Typography>

      <Typography mb={1}>হাদীস শরীফে এসেছে -</Typography>

      <Typography mb={3} className={styles.quote}>
        যাকে আল্লাহ সম্পদ দিয়েছেন, কিন্তু সে তার যাকাত দেয়নি কিয়ামতের দিন তা বিষধর স্বর্পরূপে উপস্থিত হবে এবং তা তার
        গলায় পেঁচিয়ে দেওয়া হবে। সাপটি তার উভয় অধরপ্রান্তে দংশন করবে এবং বলবে, আমিই তোমার ঐ ধন, আমিই তোমার পুঞ্জিভূত
        সম্পদ। - সহীহ বুখারী
      </Typography>
    </Box>
  );
};
