import { Box, Typography } from "@mui/material";

export const ZakatNonAssets = () => {
  return (
    <Box>
      <Typography mb={1}>১. নিজ ও পোষ্য পরিজনের অন্ন, বস্ত্র, বাসস্থান ও বাহনের ওপর যাকাত ফরয নয়।</Typography>

      <Typography>
        ২. গৃহের আসবাবপত্র যেমন খাট-পালঙ্ক, চেয়ার-টেবিল, ফ্রিজ, আলমারি ইত্যাদি এবং গার্হস্থ সামগ্রী যেমন হাড়ি-পাতিল,
        থালা-বাটি, গ্লাস ইত্যাদির উপর যাকাত ফরয নয়। তা যত উচ্চমূল্যেরই হোক না কেন।
      </Typography>

      <Typography mb={1}>
        তবে এক্ষেত্রে মনে রাখতে হবে যে, যেসব বস্তুর উপর যাকাত আসে না সেগুলোতে যদি সোনা-রুপা সংযুক্ত থাকে তাহলে অন্যান্য
        যাকাতযোগ্য সম্পদের সাথে এই সংযুক্ত সোনা-রুপারও যাকাত ফরয হবে।
      </Typography>

      <Typography mb={1}>
        ৩. পরিধেয় বস্ত্র, জুতা যদি প্রয়োজনের তুলনায় অনেক বেশিও থাকে তবুও তাতে যাকাত ফরয হবে না।
      </Typography>

      <Typography mb={1}>
        ৪. দোকান-পাট বা ব্যবসা প্রতিষ্ঠানের এমন আসবাবপত্র যা ব্যবসা পণ্য নয়, তার ওপর যাকাত ফরয নয়। তবে ফার্নিচারের
        দোকানে বিক্রির উদ্দেশ্যে যেসব ফার্নিচার রাখা থাকে তা যেহেতু বাণিজ্য দ্রব্য তাই এসবের ওপর যাকাত ফরয হবে।
      </Typography>

      <Typography mb={1}>
        ৫. ঘর-বাড়ি বা দোকানপাট তৈরি করে ভাড়া দিলে তাতেও যাকাত ফরয নয়। তবে এসব ক্ষেত্রে ভাড়া বাবদ যে অর্থ পাওয়া যাবে
        তার ওপর যাকাত ফরয হবে।
      </Typography>

      <Typography mb={1}>
        ৬. ভাড়া দেওয়ার উদ্দেশ্যে ঘর-বাড়ি বা অন্য কোনো সামগ্রী যেমন ডেকোরেটরের বড় বড় ডেগ, থালা-বাটি ইত্যাদি ক্রয়
        করলে তার ওপরও যাকাত ফরয নয়। তবে ভাড়া বাবদ প্রাপ্ত অর্থের উপর যাকাত আসবে।
      </Typography>
    </Box>
  );
};
