import { Box, Typography } from "@mui/material";

export const ZakatNisab = () => {
  return (
    <Box>
      <Typography mb={1}>১. স্বর্ণের ক্ষেত্রে যাকাতের নিসাব হল বিশ মিসকাল। আধুনিক হিসাবে সাড়ে সাত ভরি।</Typography>

      <Typography mb={1}>২. রুপার ক্ষেত্রে নিসাব হল দু’শ দিরহাম। আধুনিক হিসাবে সাড়ে বায়ান্ন তোলা।</Typography>

      <Typography mb={1}>
        ৩. প্রয়োজনের উদ্ধৃত্ত টাকা-পয়সা বা বাণিজ্যদ্রব্যের মূল্য যদি সাড়ে বায়ান্ন তোলা রুপার সমপরিমাণ হয় তাহলে
        যাকাতের নিসাব পূর্ণ হয়েছে ধরা হবে এবং এর যাকাত দিতে হবে।
      </Typography>

      <Typography mb={1}>
        ৪. যদি সোনা-রুপা, টাকা-পয়সা কিংবা বাণিজ্যদ্রব্য - এগুলোর কোনোটি পৃথকভাবে নিসাব পরিমাণ না থাকে, কিন্তু এসবের
        একাধিক সামগ্রী এ পরিমাণ রয়েছে, যা একত্র করলে সাড়ে বায়ান্ন তোলা রুপার সমমূল্য বা তার চেয়ে বেশি হয় তাহলে
        এক্ষেত্রে সকল সম্পদ হিসাব করে যাকাত দিতে হবে।
      </Typography>

      <Typography mb={1}>
        ৫. কারো কাছে সোনা-রুপা, টাকা-পয়সা কিংবা বাণিজ্যদ্রব্য পৃথকভাবে বা সম্মিলিতভাবে নিসাব পরিমাণ ছিল, বছরের মাঝে এ
        জাতীয় আরো কিছু সম্পদ কোনো সূত্রে পাওয়া গেল এক্ষেত্রে নতুন প্রাপ্ত সম্পদ পুরাতন সম্পদের সঙ্গে যোগ হবে এবং
        পুরাতন সম্পদের বছর পূর্ণ হওয়ার পর সমুদয় সম্পদের যাকাত দিতে হবে। বছরের মাঝে যা যোগ হয়েছে তার জন্য পৃথক বছর
        পূর্ণ হওয়া লাগবে না।
      </Typography>

      <Typography mb={1}>
        ৬. বছরের শুরু ও শেষে নিসাব পূর্ণ থাকলে যাকাত আদায় করতে হবে। মাঝে নিসাব কমে যাওয়া ধর্তব্য নয়। অবশ্য বছরের মাঝে
        সম্পূর্ণ সম্পদ নষ্ট হয়ে যাওয়ার পর পুনরায় যদি নিসাব পরিমাণ সম্পদের মালিক হয় তবে ঐ সময় থেকে নতুন করে বছরের
        হিসাব আরম্ভ হবে এবং এক বছর পূর্ণ হওয়ার পর যাকাত আদায় করতে হবে।
      </Typography>
    </Box>
  );
};
