import { Box, Typography } from "@mui/material";

export const ZakatNonReceivers = () => {
  return (
    <Box>
      <Typography mb={1}>১. মসজিদ নির্মাণ, রাস্তা-ঘাট, টিউবওয়েল স্থাপন, ইত্যাদি।</Typography>

      <Typography mb={1}>২. কোন প্রতিষ্ঠান, সংস্থা।</Typography>

      <Typography mb={1}>৩. মৃতের কাফন-দাফন ও তার ঋণ পরিশোধ।</Typography>

      <Typography mb={1}>৪. নিজ উর্ধ্বতন নর-নারী যেমন, বাবা-মা, দাদা-দাদী, নানা-নানী ও তদুর্ধ্বতন।</Typography>

      <Typography mb={1}>৫. নিজ অধঃস্তন নর-নারী যেমন, পুত্র-কন্যা, নাতি-নাতনী ও তধঃস্তন।</Typography>

      <Typography mb={1}>৬. স্বামী-স্ত্রী একে অপরকে।</Typography>

      <Typography mb={1}>৭. নিজ ও নিজ উর্ধ্বতন-অধঃস্তনদের গোলাম-বাঁদি।</Typography>

      <Typography mb={1}>
        ৮. মৌলিক প্রয়োজনাতিরিক্ত ও ঋণ অতিরিক্ত নিসাব পরিমাণ অর্থ-সম্পদশালী, চাই তা যাকাতযোগ্য হোক বা যাকাত অযোগ্য হোক।
        যেমন, কারো মাঠের জমি আছে যা তার প্রয়োজন নাই কিন্তু তার মূল্য নিসাব পরিমাণ তাহলে তাকে যাকাত দেওয়া যাবে না, যদিও
        সে অভাবী হোক।
      </Typography>

      <Typography mb={1}>
        ৯. নিসাব পরিমাণ অর্থ-সম্পদশালীর নাবালক ছেলে-মেয়ে। তবে বালেগ ছেলে-মেয়েকে দেওয়া যাবে, যদি তারা গরিব হয়।
      </Typography>

      <Typography mb={1}>১০. হাশেমী বংশের লোক, যদিও অভাবী হয়।</Typography>
    </Box>
  );
};
