import { Box, Typography } from "@mui/material";

export const ZakatHowToGive = () => {
  return (
    <Box>
      <Typography mb={1}>
        ১. শুধুমাত্র আল্লাহর সন্তুষ্টি লাভের নিয়তে যাকাত আদায় করতে হবে। জনসমর্থন অর্জনের জন্য, লোকের প্রশংসা কুড়ানোর
        জন্য কিংবা অন্য কোনো জাগতিক উদ্দেশ্যে যাকাত দেওয়া হলে তা আল্লাহর দরবারে কবুল হবে না।
      </Typography>

      <Typography mb={1}>
        ২. বছর অতিক্রান্ত হওয়ার পর বিলম্ব না করা। যেদিন এক বছর পূর্ণ হবে সেদিনই যাকাত আদায় করা ফরয হয়। এরপর যখনই
        যাকাত আদায় করুক সে পরিমাণই আদায় করতে হবে যা সেই দিন ফরয হয়েছিল।
      </Typography>

      <Typography mb={1}>
        ৩. যাকাত আদায় হওয়ার জন্য যাকাত প্রদানের নিয়ত করা জরুরি। যাকাত দেওয়ার সময় যাকাতের নিয়ত করতে হবে। তবে নিজের
        সম্পদ থেকে যাকাতের টাকা পৃথক করে রাখলে পৃথক করার সময়ের নিয়তই যথেষ্ট হবে। এখান থেকে ফকীর-মিসকীনকে দেওয়ার সময়
        নতুন নিয়ত না করলে ও যাকাত আদায় হয়ে যাবে।
      </Typography>

      <Typography mb={1}>
        ৪. যাকাত গ্রহণকারীকে একথা জানানোর প্রয়োজন নেই যে, তাকে যাকাত দেওয়া হচ্ছে । যেকোনো ভাবে দরিদ্র ব্যক্তিকে
        যাকাতের মাল দেওয়া হলে মালিক যদি মনে মনে যাকাতের নিয়ত করে তাহলে যাকাত আদায় হয়ে যাবে।
      </Typography>

      <Typography mb={1}>
        ৫. অন্যের পক্ষ থেকে যাকাত আদায় করতে হলে তার অনুমতি নিতে হবে। অন্যথায় সে ব্যক্তির পক্ষ থেকে যাকাত আদায় হবে না।
      </Typography>

      <Typography mb={1}>
        ৬. কোনো দরিদ্র ব্যক্তির কাছে কারো কিছু টাকা পাওনা থাকলে যাকাতের নিয়তে পাওনা মাফ করে দিলে যাকাত আদায় হবে না।
        এক্ষেত্রে প্রথমে তাকে যাকাত প্রদান করে সেই টাকার মালিক বানাতে হবে। এরপর সেখান থেকে ঋণ উসূল করে নিতে পারবে।
      </Typography>

      <Typography mb={1}>
        ৭. যাকাতের টাকা এমন দরিদ্রকে দেওয়া উত্তম যে দ্বীনদার। দ্বীনদার নয় এমন লোক যদি যাকাতের উপযুক্ত হয় তাহলে তাকেও
        যাকাত দেওয়া যাবে। কিন্তু যদি প্রবল ধারণা হয় যে, যাকাতের টাকা দেওয়া হলে লোকটি সে টাকা গুনাহের কাজে ব্যয় করবে
        তাহলে তাকে যাকাত দেওয়া জায়েয নয়।
      </Typography>

      <Typography mb={1}>
        ৮. যাকাত শুধু মুসলমানদেরকেই দেওয়া যাবে। হিন্দু, বৌদ্ধ, খৃষ্টান বা অন্য কোনো অমুসলিমকে যাকাত দেওয়া হলে যাকাত
        আদায় হবে না।
      </Typography>

      <Typography mb={1}>
        ৯. যাকাতের টাকা যাকাতের হক্বদারদের নিকট পৌঁছে দিতে হবে। যাকাতের নির্ধারিত খাতে ব্যয় না করে অন্য কোনো
        জনকল্যাণমূলক কাজে ব্যয় করা হলে যাকাত আদায় হবে না। যাকাত আদায় হওয়ার জন্য শর্ত হল, উপযুক্ত ব্যক্তিকে মালিক
        বানিয়ে দেওয়া। যাতে সে নিজের খুশি মতো তার প্রয়োজন পূরণ করতে পারে।
      </Typography>
    </Box>
  );
};
